microchip-pic-avr-examples/dspic33a-dual-partition-code-examples/dspic33ak512mps512_dual_partition_demo/example0/shared_code/command.c
static struct FLASH_REGION * const flashRegion[] = 
{
    &flashRegion0,
    &flashRegion1,
    &flashRegion2,
    &flashRegion3,
    &flashRegion4,
    &flashRegion5,
    &flashRegion6,
    &flashRegion7,
};

static void BreakpointDemo(void)
{
    /* Wait until all UART data is transmitted before triggering the
     * breakpoint to prevent garbled terminal data. */
    while(UART1_IsTxDone() == false)
    {
    }

    BreakpointExample();
}

static char panelStrings[4][5] = {
    "DATA",
    "1   ",
    "   2",
    "BOTH"
};

static char* PartitionStringGet(struct FLASH_REGION * const region){
    enum PANEL panel = region->panelGet();
    char* result;
    
    if(panel == PANEL_BOTH){
        result = "BOTH    ";
    } else if(((panel == PANEL_1) && (PARTITION_ActiveGet() == 1)) ||
       ((panel == PANEL_2) && (PARTITION_ActiveGet() == 2))) {
        result = "ACTIVE  ";
    } else {
        result = "INACTIVE";
    }
    
    return result;    
}

static void FlashRegionInfoPrint(void)
{
    (void)printf("  Flash Regions\r\n");
    (void)printf("  -------------------------------------------\r\n");
    (void)printf("  NUMBER | PANEL | PARTITION | WRITE ENABLED \r\n");
    
    for(size_t i=0; i<(sizeof(flashRegion)/sizeof(struct FLASH_REGION * const)); i++) {
        struct FLASH_REGION * const region = flashRegion[i];
        
        (void)printf("   "); //text alignment
        (void)printf("%u        ", i);  //Number
        (void)printf("%s    ", panelStrings[region->panelGet()]); //Panel
        (void)printf("%s   ", PartitionStringGet(region));
        (void)printf("%s", region->isWriteEnabled() ? "true" : "false");
        (void)printf("\r\n");
    }
}

/**
 * @ingroup  menu.c
 * @brief    Prints the menu options.
 * 
 * @param    none
 * @return   none
 */
void MENU_Print(void)
{
    (void)printf("\r\n");
    (void)printf("\r\n");
    (void)printf("=============================================\r\n");
    (void)printf("Dual Partition Demo\r\n");
    (void)printf("=============================================\r\n");

    RESET_PrintResetSources();
    
    /* Clear all sources */
    RCON = 0;
    
    (void)printf("\r\n");
    
    SequenceInfoPrint();
    
    (void)printf("\r\n");
    
    FlashRegionInfoPrint();
    
    for(size_t i=0; i<(sizeof(commands)/sizeof(struct COMMAND)); i++)
    {
        struct COMMAND* command = &commands[i];
        
        if(command->type == TYPE_GROUP){
            (void)printf("\r\n");
            (void)printf("  %s:\r\n", command->description);
            (void)printf("  -------------------------------------------\r\n");
        } else {
            (void)printf("    '%c' : %s\r\n", command->code, command->description);
        }
    }
    
    (void)printf("\r\n");
    (void)printf("Command: ");
}

static void PrintRegion(uint32_t address)
{
    uint8_t data[PRINT_REGION_SIZE];
    
    memcpy(data, (void*)address, sizeof(data));
      
    for(int i=0; i<sizeof(data); i++){
        if((i % 16) == 0)
        {
            (void)printf("\r\n  %08lX: ", (unsigned long)(address + i));
        }
        
        printf(" %02lX ", (unsigned long)data[i]);
    }
    
    (void)printf("\r\n\r\n");
}

void COMMAND_Process(void)
{    
    struct COMMAND* command = NULL;

    MENU_Print();

    char command_code = SCAN_Char(true);

    (void)printf("\r\n\r\n");

    for(size_t i=0; i<(sizeof(commands)/sizeof(struct COMMAND)); i++) {
        if(commands[i].code == command_code) {
            command = &commands[i];
            break;
        }
    }
    
    if(command == NULL) {
        (void)printf("Invalid request.\r\n");
    } else {
        command->execute();
    }
}


static void PrintActiveTestArea(void)
{
    PrintRegion(0x810000);
}

static void PrintInactiveTestArea(void)
{
    PrintRegion(0xC10000);
}

static void WriteActiveTestArea(void)
{
    flash_data_t data[PRINT_REGION_SIZE/4] = {
        0x00010203, 0x04050607, 0x08090A0B, 0x0C0D0E0F,
        0x10111213, 0x14151617, 0x18191A1B, 0x1C1D1E1F,
        0x20212223, 0x24252627, 0x28292A2B, 0x2C2D2E2F,
        0x30313233, 0x34353637, 0x38393A3B, 0x3C3D3E3F,
        0x40414243, 0x44454647, 0x48494A4B, 0x4C4D4E4F,
        0x50515253, 0x54555657, 0x58595A5B, 0x5C5D5E5F,
        0x60616263, 0x64656667, 0x68696A6B, 0x6C6D6E6F,
        0x70717273, 0x74757677, 0x78797A7B, 0x7C7D7E7F,
    };
        
    FLASH_WordWrite(0x810000, &data[0], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0x810010, &data[4], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0x810020, &data[8], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0x810030, &data[12], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0x810040, &data[16], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0x810050, &data[20], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0x810060, &data[24], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0x810070, &data[28], FLASH_UNLOCK_KEY);
    
    PrintRegion(0x810000);
}

static void WriteInactiveTestArea(void)
{    
    flash_data_t data[PRINT_REGION_SIZE/4] = {
        0xFCFDFEFF, 0xF8F9FAFB, 0xF4F5F6F7, 0xF0F1F2F3,
        0xECEDEEEF, 0xE8E9EAEB, 0xE4E5E6E7, 0xE0E1E2E3,
        0xDCDDDEDF, 0xD8D9DADB, 0xD4D5D6D7, 0xD0D1D2D3,
        0xCCCDCECF, 0xC8C9CACB, 0xC4C5C6C7, 0xC0C1C2C3,
        0xBDBDBEBF, 0xB8B9BABB, 0xB4B5B6B7, 0xB0B1B2B3,
        0xADADAEAF, 0xA8A9AAAB, 0xA4A5A6A7, 0xA0A1A2A3,
        0x9D9D9E9F, 0x98999A9B, 0x94959697, 0x90919293,
        0x8C8D8E8F, 0x88898A8B, 0x84858687, 0x80818283,
    };
        
    FLASH_WordWrite(0xC10000, &data[0], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0xC10010, &data[4], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0xC10020, &data[8], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0xC10030, &data[12], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0xC10040, &data[16], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0xC10050, &data[20], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0xC10060, &data[24], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0xC10070, &data[28], FLASH_UNLOCK_KEY);
    
    PrintRegion(0xC10000);
}

/**
 * @ingroup  command.c
 * @brief    Erases the test area in the specified flash region. Used to test
 *           the flash region protection settings. Use the unlock('u'), lock('l')
 *           and lock until reset('x') commands to test out various situations
 *           regarding the flash region lock.
 * 
 * @param    none
 * @return   none
 */
static void EraseActiveTestArea(void)
{
    FLASH_PageErase(0x810000, FLASH_UNLOCK_KEY);
    PrintRegion(0x810000);
}

/**
 * @ingroup  command.c
 * @brief    Erases the test area in the specified flash region. Used to test
 *           the flash region protection settings. Use the unlock('u'), lock('l')
 *           and lock until reset('x') commands to test out various situations
 *           regarding the flash region lock.
 * 
 * @param    none
 * @return   none
 */
static void EraseInactiveTestArea(void)
{
    FLASH_PageErase(0xC10000, FLASH_UNLOCK_KEY);
    PrintRegion(0xC10000);
}

static bool RegionNumIsValid(uint8_t regionNum)
{  
    return (regionNum <= 7U);
}

/**
 * @ingroup  command.c
 * @brief    Scan user input for a flash region (0-7 allowed)
 * 
 * @param    none
 * @return   none
 */
static bool GetRegionSelection(uint8_t* regionNum)
{    
    (void)printf("Enter the region number (0-7): ");
    
    char inputChar = SCAN_Char(true);  // Store the result of SCAN_Char
    *regionNum = (uint8_t)((uint8_t)inputChar - (uint8_t)'0');  // Convert from ASCII to integer
    
    (void)printf("\r\n\r\n");
    
    bool isValid = RegionNumIsValid(*regionNum);
        
    if(isValid == false)
    {
        (void)printf("Invalid region number.\r\n\r\n");
    }

