microchip-pic-avr-examples/dspic33a-dual-partition-code-examples/dspic33ak512mps512_dual_partition_demo/example0/shared_code/command.c
    /* cppcheck-suppress misra-c2012-11.6
     *
     *  (Rule 11.6) REQUIRED: A cast shall not be performed between
     *  pointer to void and an arithmetic type
     *
     *  Reasoning: This copies the sequence code value of the requested
     *  partition into the sequenceCode buffer. Because the address may live
     *  outside of active partition, there is no way to create an object at
     *  that address to reference so an integer address is used.
     */
    memcpy(sequenceCode, (void*)address, sizeof(sequenceCode));

    info->address = address;
    info->sequenceNumber = (uint16_t)(sequenceCode[0] & 0xFFFU);
    info->inverseSequenceNumber = (uint16_t)((sequenceCode[0] >> 12) & 0xFFFU);
    info->valid = SequenceCodeIsValid(sequenceCode);
}

/**
 * @ingroup  menu.c
 * @brief    Returns "Active" or "Inactive" for the specified partition number.
 *
 * @param    partitionNumber - partition number (1 or 2)
 * @return   const char* - state string
 */
static const char* PartitionStateStringGet(uint8_t partitionNumber)
{
    if(PARTITION_ActiveGet() == partitionNumber)
    {
        return "Active";
    }
    else
    {
        return "Inactive";
    }
}

/**
 * @ingroup  menu.c
 * @brief    Returns "Valid" or "Invalid" for sequence number display.
 *
 * @param    valid - validity state
 * @return   const char* - validity string
 */
static const char* ValidStringGet(bool valid)
{
    if(valid)
    {
        return "Valid";
    }
    else
    {
        return "Invalid";
    }
}

/**
 * @ingroup  menu.c
 * @brief    Prints one row of the sequence number table.
 *
 * @param    partitionLabel - displayed partition label
 * @param    partitionNumber - partition number (1 or 2)
 * @param    address - sequence number address
 * @return   none
 */
static void SequenceInfoRowPrint(const char *partitionLabel,
                                 uint8_t partitionNumber,
                                 uint32_t address)
{
    struct SEQUENCE_INFO info;

    SequenceInfoGet(address, &info);

    (void)printf("  %-16s | %-15s | %03X       | %03X              | %-7s | 0x%06lX\r\n",
                 partitionLabel,
                 PartitionStateStringGet(partitionNumber),
                 (unsigned int)info.sequenceNumber,
                 (unsigned int)info.inverseSequenceNumber,
                 ValidStringGet(info.valid),
                 (unsigned long)info.address);
}

/**
 * @ingroup  menu.c
 * @brief    Prints sequence number information for both partitions in a
 *           table format. Indicates which partition is currently active and
 *           whether the stored sequence number encoding is valid.
 *
 * @param    none
 * @return   none
 */
static void SequenceInfoPrint(void)
{
    (void)printf("  Sequence Number\r\n");
    (void)printf("  ------------------------------------------------------------------------------------------------\r\n");
    (void)printf("  Partition Number | Active/Inactive | Seq. Num. | Inverse Seq. Num | Valid   | Address Seq. Num. \r\n");
    (void)printf("  -----------------|-----------------|-----------|------------------|---------|-------------------\r\n");

    SequenceInfoRowPrint("Partition 1", 1U, PARTITION1_SEQUENCE_NUMBER_ADDRESS);
    SequenceInfoRowPrint("Partition 2", 2U, PARTITION2_SEQUENCE_NUMBER_ADDRESS);
}
